---
kind: property
id: P:Autodesk.Revit.DB.Events.DocumentSaveToLocalProgressChangedEventArgs.SaveToLocalFinished
source: html/38186363-5ff6-0676-1e7f-4341ddefeac7.htm
---
# Autodesk.Revit.DB.Events.DocumentSaveToLocalProgressChangedEventArgs.SaveToLocalFinished Property

Indicates if the current "save to local" operation has finished.

## Syntax (C#)
```csharp
public bool SaveToLocalFinished { get; }
```